(package! flycheck-aspell)
(package! calfw)
(package! multiple-cursors)
(package! calfw-org)
(package! dashboard)
(package! dired-open)
(package! dired-subtree)
(package! dirvish)
(package! dmenu)
(package! ednc)
(package! emojify)
(package! evil-tutor)
(package! exwm)
(package! imenu-list)
(package! ivy-posframe)
(package! mw-thesaurus)
(package! org-auto-tangle)
(package! org-web-tools)
(package! ox-gemini)
(package! peep-dired)
(package! password-store)
(package! rainbow-mode)
(package! resize-window)
(package! tldr)
(package! wc-mode)
(package! beacon)
(package! clippy)
(package! minimap)
(package! olivetti)

(package! gptel) ;; GPT
(package! lsp-treemacs)
(package! ef-themes)
(package! notmuch)
(package! nano-theme)
(package! xresources-theme)
(package! theme-magic)

(package! ewal)
(package! ewal-spacemacs-themes)
(package! ewal-evil-cursors)
(package! ewal-doom-themes)
;; (package! spaceline)

(package! eat)
